package algorithm.chapter8.template.dp;

/**
 * �?818. 赛车】你的赛车起始停留在位置 0，�?�度�? +1，正行驶在一个无限长的数轴上。（车也可以向负数方向行驶�?�） 你的车会根据�?系列�? A（加速）�?
 * R（�?�车）组成的指令进行自动驾驶 �? 当车得到指令 "A" �?, 将会做出以下操作： position += speed, speed *= 2�?
 * 当车得到指令 "R" �?, 将会做出以下操作：如果当前�?�度是正数，则将车�?�调整为 speed = -1 ；否则将车�?�调整为 speed = 1。�?
 * (当前�?处位置不变�??) 例如，当得到�?系列指令 "AAR" �?, 你的车将会走过位�? 0->1->3->3，并且�?�度变化为�?1->2->4->-1�?
 * 现在给定�?个目标位置，请给出能够到达目标位置的�?短指令列表的长度�? 示例 1: 输入: target = 3 输出: 2
 * 
 * 来源：力扣（LeetCode�? 链接：https://leetcode-cn.com/problems/race-car
 * 著作权归领扣网络�?有�?�商业转载请联系官方授权，非商业转载请注明出处�??
 * 
 * @author chying
 *
 */
public class RaceCar {

	public int racecar(int target) {
		return 0;
	}

	public static void main(String[] args) {
		RaceCar a = new RaceCar();
	}
}
